app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Infiltrator"], ["rating", "R"], ["release_date", "2018-10-07 00:00:00.000000"], ["created_at", "2018-10-07 21:00:37.803731"], ["updated_at", "2018-10-07 21:00:37.803731"]]
---
  def create
    @movie = Movie.create!(movie_params)